; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image0 - mode
	spectrograph2 - mode
	spectrograph3 - mode
	spectrograph1 - mode
	GroundStation1 - direction
	Star3 - direction
	Star5 - direction
	GroundStation4 - direction
	Star7 - direction
	GroundStation0 - direction
	Star8 - direction
	GroundStation2 - direction
	Star6 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 image0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star7)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument3 spectrograph3)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph2)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 Star8)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
)
(:goal (and
	(pointing satellite0 Star14)
	(have_image Phenomenon9 spectrograph1)
	(have_image Planet10 spectrograph2)
	(have_image Phenomenon11 spectrograph3)
	(have_image Planet12 image0)
	(have_image Phenomenon13 spectrograph1)
	(have_image Star14 spectrograph2)
	(have_image Planet15 image0)
	(have_image Planet16 spectrograph2)
	(have_image Phenomenon17 image0)
))

)

; plan
1. (turn_to satellite1 groundstation2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 10
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 10
3. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 10
4. (turn_to satellite1 phenomenon9 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 10
5. (take_image satellite1 phenomenon9 instrument3 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon13 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 10
7. (take_image satellite1 phenomenon13 instrument3 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 2 of 10
8. (turn_to satellite1 phenomenon11 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 10
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 10
10. (calibrate satellite0 instrument0 star7)
   added: (calibrated instrument0)
   goals met: 2 of 10
11. (take_image satellite1 phenomenon11 instrument3 spectrograph3)
   added: (have_image phenomenon11 spectrograph3)
   goals met: 3 of 10
12. (turn_to satellite0 phenomenon17 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon17)
   goals met: 3 of 10
13. (take_image satellite0 phenomenon17 instrument0 image0)
   added: (have_image phenomenon17 image0)
   goals met: 4 of 10
14. (turn_to satellite0 planet10 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet10)
   goals met: 4 of 10
15. (take_image satellite0 planet10 instrument0 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 5 of 10
16. (turn_to satellite0 planet12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet12)
   goals met: 5 of 10
17. (take_image satellite0 planet12 instrument0 image0)
   added: (have_image planet12 image0)
   goals met: 6 of 10
18. (turn_to satellite0 planet15 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet15)
   goals met: 6 of 10
19. (take_image satellite0 planet15 instrument0 image0)
   added: (have_image planet15 image0)
   goals met: 7 of 10
20. (turn_to satellite0 planet16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet16)
   goals met: 7 of 10
21. (take_image satellite0 planet16 instrument0 spectrograph2)
   added: (have_image planet16 spectrograph2)
   goals met: 8 of 10
22. (turn_to satellite0 star14 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star14)
   goals met: 9 of 10
23. (take_image satellite0 star14 instrument0 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 10 of 10
